w21d1/art_share_app/app/controllers/artwork_shares_controller.rb

  def create
    artwork_share = ArtworkShare.new(artwork_share_params)

    if artwork_share.save
---
INSERT INTO "artwork_shares" ("viewer_id", "artwork_id", "created_at", "updated_at", "is_favorited") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["viewer_id", 9], ["artwork_id", 10], ["created_at", "2023-01-20 00:14:44.017976"], ["updated_at", "2023-01-20 00:14:44.017976"], ["is_favorited", nil]]

  def favorite
    artshare = ArtworkShare.find_by(id: params[:id], viewer_id: params[:user_id])
    artshare.is_favorited = true
    if artshare.save
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 AND "artwork_shares"."artwork_id" IS NULL AND "artwork_shares"."viewer_id" IS NULL LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "updated_at" = $1, "is_favorited" = $2 WHERE "artwork_shares"."id" = $3  [["updated_at", "2023-01-20 01:00:25.089140"], ["is_favorited", true], ["id", 8]]

  def unfavorite
    share = ArtworkShare.find_by(id: params[:id], viewer_id: params[:user_id])
    share.is_favorited = false
    if share.save
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 AND "artwork_shares"."viewer_id" = $2 LIMIT $3  [["id", 8], ["viewer_id", 8], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "updated_at" = $1, "is_favorited" = $2 WHERE "artwork_shares"."id" = $3  [["updated_at", "2023-01-20 01:00:33.553690"], ["is_favorited", false], ["id", 8]]