w21d1/art_share_app/app/controllers/artworks_controller.rb

  def like
    like = Like.new(likeable_type: 'Artwork', likeable_id: params[:id], user_id: params[:user_id])
    if like.save
---
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Artwork"], ["likeable_id", 8], ["created_at", "2023-01-21 20:26:02.221359"], ["updated_at", "2023-01-21 20:26:02.221359"], ["user_id", nil]]

  def comment
    comment = Comment.new(artwork_id: params[:id], body: 'this is a comment', user_id: 9)
    if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 9], ["artwork_id", 10], ["body", "this is a comment"], ["created_at", "2023-01-21 21:07:34.601720"], ["updated_at", "2023-01-21 21:07:34.601720"]]

  def favorite
    artwork = Artwork.find_by(id: params[:id], artist_id: params[:user_id])
    artwork.is_favorited = true
    artwork.save
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 AND "artworks"."artist_id" = $2 LIMIT $3  [["id", 10], ["artist_id", 9], ["LIMIT", 1]]
UPDATE "artworks" SET "updated_at" = $1, "is_favorited" = $2 WHERE "artworks"."id" = $3  [["updated_at", "2023-01-19 01:52:11.333888"], ["is_favorited", true], ["id", 10]]

  def unfavorite
    artwork = Artwork.find_by(id: params[:id], artist_id: params[:user_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def add_to_collection
    listing = ArtListing.new(artwork_id: params[:id], collection_id: params[:collection_id])
    if listing.save
      collection = ArtworkCollection.find_by(id: params[:collection_id], name: params[:name])
---
INSERT INTO "art_listings" ("artwork_id", "collection_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 10], ["collection_id", 2], ["created_at", "2023-01-19 21:00:48.707180"], ["updated_at", "2023-01-19 21:00:48.707180"]]
SELECT "artwork_collections".* FROM "artwork_collections" WHERE "artwork_collections"."id" = $1 AND "artwork_collections"."name" = $2 LIMIT $3  [["id", 2], ["name", "sam's art"], ["LIMIT", 1]]