w21d1/art_share_app/app/controllers/comments_controller.rb

  def index

    if params[:artwork_id]
      art = Artwork.find(params[:artwork_id])
      data = art.comments
    end

    if params[:user_id]
      user = User.find(params[:user_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]