w21d1/art_share_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if params[:username]
      input_str = params[:username].split('').map {|letter| "'#{letter}%'" }
      .join(" OR username ILIKE ")

      sql_query = "
        SELECT *
        FROM users
        WHERE username ILIKE #{input_str}
      "
      users = ActiveRecord::Base.connection.execute(sql_query)
    else
      users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "username" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-12-28 18:02:36.473310"], ["username", "murl"], ["id", 11]]
---
  def update
    user = User.find(params[:id])

    if user.update(user_params)

INSERT INTO "artwork_collections" ("collector_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["collector_id", 8], ["name", "sam's art"], ["created_at", "2023-01-19 20:55:58.564892"], ["updated_at", "2023-01-19 20:55:58.564892"]]
---
  def create_collection
    collection = ArtworkCollection.new(name: params[:name], collector_id: params[:id])
    if collection.save